import asyncio
import edge_tts

TEXT = """مشتری عزیزمون که خیلی وقت بود دنبالمون بود، جشن و پیجمون رو دنبال می‌کرد. بعد خواستن خودشون سرزده و کاملاً دلی، و با کلی سؤال فراوون، وارد فست‌فودمون شدن. از همون لحظهٔ اول، رفتارشون نشون می‌داد که وایب خوبی از فست‌فودمون گرفتن. ما هم تلاش کردیم با بهترین آیتم‌های فست‌فودمون ازشون پذیرایی کنیم. فست‌فود دولُپی، احترام به مشتری رو حرف اول می‌ذاره. ما هم تمام تلاشمون رو کردیم که مشتری‌مون راضی باشه. و در آخر، با رضایت خیلی خاصی کارتشون رو تقدیم کردن و تازه گفتن تخفیف هم نمی‌خوان. خودشون هم از پرسنل ما تشکر کردن و گفتن که برامون مشتری می‌فرستن، و خودشون هم مشتری ثابت‌مون شدن."""

async def main():
    voice = edge_tts.Communicate(TEXT, "fa-IR-FaridNeural", rate="+12%", pitch="+8Hz", volume="+0%")
    await voice.save("full_narration_dolopi.mp3")

asyncio.run(main())
